//"number"+ 3 + 3 буде  number33 конкатинація

null + 3 буде 3 null приводиться до нуля (0+3=3)

5 && "qwerty" буде qwerty логічні операціі, && повертає остатнє значення

+'40' + +'2' + "hillel"; буде '40' як число 40,'2'як число 2 (40+2=42) 42hillel конкатинація


'10' - 5 === 6; буде '10'як число 10 -5 =5 === (use strict)5 ===6 false

true + false буде true э 1, falce 0 , 1+0 =1

'4px' - 3 буде '4px' не можна перевести в число =NaN -3 =NaN

'4' - 3 буде '4' то 4-3=1 строка переводиться в число

'6' + 3 ** 0; буде сначала степень 3**0 =1, так как строка то конкатинація 61 все соединяется

12 / '6' буде '6' в число 6 буде 12/6=2 

'10' + (5 === 6);буде сначала в скобках 5 не равно 6 значит false, строка плюс что то будет '10false'

null == ''буде  null  не равно не заданому значению значит false , null равно только undefined

3 ** (9 / 3);буде сначала в скобках 9/3 =3 , 3**3 =27

!!'false' == !!'true' буде ! інвертує булеве значення, если не пустая строка то true, !! - convert in Boolean. 
!!'false' не пусто значит true, true==true

0 || '0' && 1 буде  && делаю первое 0 и 1 =1, 0 or 1 - буде 1  если строка не пустая то будет true, 0 - false, 1 - true


(+null == false) < 1;буде унарный +null= (0==false), == порівнює два значення на рівність, JS приводить до числа 0==0 что есть true <1 , boolean true =1, 1<1 false

false && true || true буде сначала && поверне true якщо обидва true иначе = false II true, II поверне true якщо хоть одна операнда true = true

false && (false || true);буде  сначала в скобках буде true, false &&true = false

(+null == false) < 1 ** 5;буде сначала в скобках буде (+null = 0 ==false это true (1)),1<1**5 , 1**5 = 1, 1<1 = false